TestingTool_3-0/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <basedOn>Catalog.ПланыТестирования</basedOn>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>СозданныеАвтоматически</name>
      <description>Созданные автоматически</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Лицензия</name>
    <comment>Права использования и распространения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВариантХраненияСценария</name>
    <type>
      <types>EnumRef.ВариантыХраненияСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланТестирования</name>
    <type>
      <types>CatalogRef.ПланыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьДефекта</name>
    <type>
      <types>EnumRef.ВариантыСерьезностиДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТеста</name>
    <type>
      <types>EnumRef.ТипыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСценария</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DataDrivenTest</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуБиблиотекиСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Catalogs/Тесты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа=Ложь Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.ПланыТестирования") Тогда
		ПланТестирования = ДанныеЗаполнения;
		// Формирование описания
		Описание = "Шаги/Действия "+Символы.ПС;
		Для каждого стр из ДанныеЗаполнения.ШагиДействия Цикл
			Описание = Описание+стр.НомерСтроки+") "+стр.Описание+Символы.ПС;
		КонецЦикла;
		Описание = Описание+"Ожидаемые результаты "+Символы.ПС;
		Для каждого стр из ДанныеЗаполнения.ОжидаемыеРезультаты Цикл
			Описание = Описание+стр.НомерСтроки+") "+стр.Описание+Символы.ПС;
		КонецЦикла;
		Проект = ДанныеЗаполнения.Проект;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйОбъект = ЭтоНовый();
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", ЭтоНовыйОбъект);
	
	Если ЭтоНовыйОбъект И НЕ ЗначениеЗаполнено(ДатаСоздания) И НЕ ЭтоГруппа Тогда
		ДатаСоздания = ТекущаяДата();
		//Автор        = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ID = "";
КонецПроцедуры

#КонецОбласти

#КонецЕсли
